'''
すでに入力されているコードを使い、「プログラム中で行う処理」の順番で処理を行うプログラムを作成し、実行結果のように出力してください。
なお、同じ行のデータが同じ並びになるとは限りません。
同じデータが出力されているか確認してください。

[ プログラム中で行う処理 ]
1. 「ユーザー1」と「ユーザー3」の和集合を「u13_colors」という名前で保存する
2. 「ユーザー2」と「ユーザー3」の差集合を「u23_colors」という名前で保存する
3. 「ユーザー1」と「ユーザー2」と「ユーザー3」の対称差を「u123_colors」という名前で保存する
4. 「u12_colors」を出力する
5. 「u13_colors」を出力する
6. 「u23_colors」を出力する
7. 「u123_colors」を出力する

[ 実行結果 ]
{'赤', '緑'}
{'緑', '赤', '青', '黒', '黄'}
{'白', '緑', '赤'}
{'黄', '白', '黒'}
'''

##### 以下のコードは書き換えることなく必ず利用してください
users_colors = {
    'ユーザー1': { '赤', '青', '緑' },
    'ユーザー2': { '緑', '白', '赤' },
    'ユーザー3': { '青', '黒', '黄' }
}

u12_colors = users_colors[ 'ユーザー1' ] & users_colors[ 'ユーザー2' ]
#####

