'''
次の各データをリストでまとめてください。リストの変数名は自由に決めて構いません。
そして「プログラム中で行う処理」の順番で処理を行うプログラムを作成し、実行結果の通り出力してください。
なお、「▲」で始まる行は分岐条件を表し、「┼」の記号が条件による分岐処理の区切り、「▼」が分岐処理すべての終了位置を表しています。

[ データ ]
10
30
60
90
100

[ プログラム中で行う処理 ]
1. キーボードから数値を入力させ、それを変数に保存する
2. ▲ 入力された数値がリストに含まれているか確認する
3. │ 含まれていたら「登録済みです」と画面に出力する
4. ┼
5. │ 含まれていなければ、入力された数値をリストに追加する
6. ▼
7. リストのすべての値を画面に出力する

[ 実行結果 ] ※「<_ _>」の範囲が実行時にキーボードから入力する部分です
数値を入力＞ <_30_>
登録済みです
[ 10, 30, 60, 90, 100 ]
※--- ここでプログラム終了 ---※

数値を入力＞ <_80_>
[ 10, 30, 60, 90, 100, 80 ]
※--- ここでプログラム終了 ---※
'''


