'''
次のキーと値のセットをディクショナリとしてまとめてください。ディクショナリの変数名は自由に決めて構いません。
そして「プログラム中で行う処理」の順番で処理を行うプログラムを作成し、実行結果の通り出力してください。
なお、「▲」で始まる行は分岐条件を表し、「┼」の記号が条件による分岐処理の区切り、「▼」が分岐処理すべての終了位置を表しています。

[ データ ]
キー		値
network		60
database	80
security	50

[ プログラム中で行う処理 ]
1. キーボードから科目名を入力させ、それを変数に保存する
2. ▲ 入力された科目名がディクショナリのキーに含まれているか確認する
3. │ 含まれていたら「登録済みです」と画面に出力する
4. ┼
5. │ 含まれていなければ得点の入力を促す
6. │ 1で入力された科目名をキーとして、4で入力された数値をディクショナリに追加する
7. ▼
8. ディクショナリのすべての値を画面に出力する

[ 実行結果 ] ※「<_ _>」の範囲が実行時にキーボードから入力する部分です
科目名を入力＞ <_network_>
登録済みです
{'network': 60, 'database': 80, 'security': 50}
※--- ここでプログラム終了 ---※

科目名を入力＞ <_python_>
得点を入力＞ <_80_>
{'network': 60, 'database': 80, 'security': 50, 'python': 80}
※--- ここでプログラム終了 ---※
'''

