'''
入力したメッセージをファイル「diary.txt」に追記保存し、「おわり」と入力されたら「diary.txt」からすべてのデータを読み込んで画面へ出力するプログラムを作成してください。
入力するメッセージは実行結果の通りでなくても構いません。
なお、入力の終了を示す「おわり」というメッセージはファイルに保存しないでください。
ファイルからの読み込みはすでに入力済みのコードを改造して作成して構いません。

[ 実行結果 ] ※「<_ _>」の範囲が実行時にキーボードから入力する部分です
メッセージをどうぞ： <_今日は海老川に出かけた_>
メッセージをどうぞ： <_今日は利根川に出かけた_>
メッセージをどうぞ： <_今日は江戸川に出かけた_>
メッセージをどうぞ： <_今日は休川日_>
メッセージをどうぞ： <_今日は荒川を流れた_>
メッセージをどうぞ： <_おわり_>
「diary.txt」の内容
今日は海老川に出かけた
今日は利根川に出かけた
今日は江戸川に出かけた
今日は休川日
今日は荒川を流れた
'''



##### ファイル読み込みのサンプルコード ※ファイルから読み込んだ内容は変数dataに保存されます
with open('ファイル名', 'r', encoding='UTF-8') as file:
    data = file.read()


