'''
標準モジュール「sqlite3」を使って「プログラム中で行う処理」の順番で処理を行い、実行結果の通り出力するプログラムを作成してください。
なお、利用するクエリは「クエリ」に示すものを参考にしてください。

[ プログラム中で行う処理 ]
1. 「student」テーブルが存在しなければ「テーブル構造」に示すテーブルを作成する
2. 「データ」に示す値をテーブルへ追加する(重複して構いません)
3. テーブルのデータをすべて取得し、画面へ実行結果の通り出力する

[ テーブル構造 ]
テーブル名：student
列1　列名: id　データ型: text
列2　列名: name　データ型: text

[ データ ]
ID: x99j000, 名前: 船橋　太郎
ID: x99j999, 名前: 船橋　九郎

[ クエリ ]
※テーブル作成(IF NOT EXISTSを付けると、テーブルが存在しないときだけ作成する)
CREATE TABLE IF NOT EXISTS テーブル名(列名1 データ型, 列名2 データ型, ...)
※データ追加
INSERT INTO テーブル名(列名1, 列名2, ...) VALUES(列1の値, 列2の値, ...)
※データ抽出
SELECT 列名1, 列名2, ... FROM テーブル名

[ 実行結果 ]
19j000 | 船橋　太郎
19j999 | 船橋　次郎
'''

